[
    {
        "id": 1,
        "name": "CASDEN",
        "img": "",
        "label": "Alternance développeur Fullstack",
        "company": "Digital4Better",
        "startingDate": "2021-09-06",
        "endingDate": "2022-03-14",
        "location": "Rennes",
        "technologies": ["Vue", "TS", "Node", "TypeOrm", "GraphQl"],
        "link": "https://www.casden.fr/",
        "description": "Pour ce projet, j'ai intégré une équipe de développeur, le but du projet était de réaliser un dashboard pour faciliter le suivi des actions de terrains entre la CASDEN et la banque populaire. Le projet utilisait du Vue js / Typescript pour le front et nodejs / Typeorm / graphql pour le back. J'ai pu développer des fonctionnalités de filtres, différents formulaires avec l'intégration du design que cela impliquait. J'ai également implémenté les relations avec la base de donnée que cela impliquait, fait des scripts de migrations pour adapter la base de donnée..."
    },
    {
        "id": 2,
        "name": "CATS",
        "img": "",
        "label": "Stage développeur Java",
        "company": "Crédit Agricole Technologie & Services",
        "startingDate": "2018-08-01",
        "endingDate": "2018-12-21",
        "location": "Vannes",
        "technologies": ["Java", "Spring", "MySql"],
        "link": "",
        "description": "Lors de mon stage au sein du Crédit Agricole, j'ai eu l'opportunité de travailler sur un projet visant à développer une application pour le système d'information (SI) de la banque, afin d'assurer un suivi efficace des anomalies sur les cartes de crédit qui utilisent l'application Xpay. L'objectif principal de ce projet est d'améliorer la qualité du service client et de minimiser les risques liés aux transactions frauduleuses."
    },
    {
        "id": 3,
        "name": "MyPatientCare",
        "img": "",
        "label": "Alternance développeur Fullstack",
        "company": "Hoppen",
        "startingDate": "2020-03-16",
        "endingDate": "2020-08-31",
        "location": "Rennes",
        "technologies": ["React", "Nodejs", "MySql"],
        "link": "https://www.hoppen.care/nos-solutions/",
        "description": "Lors de ma première alternance, j'ai intégré une équipe de développeurs chez Hoppen. Pour ce projet, j'ai participé à la réalisation d'une application de suivi de patients dans les hôpitaux. J'ai pu développer différentes fontionnalités front et back pour ce projet."
    },
    {
        "id": 4,
        "name": "MyHoppenVision",
        "img": "",
        "label": "Alternance développeur Fullstack",
        "company": "Hoppen",
        "startingDate": "2020-02-03",
        "endingDate": "2020-08-31",
        "location": "Rennes",
        "technologies": ["React", "Nodejs", "MySql"],
        "link": "https://www.hoppen.care/nos-solutions/",
        "description": "Lors de ma première alternance, j'ai intégré une équipe de développeurs chez Hoppen. Pour ce projet, j'ai participé à la réalisation d'une application de visioconférence disponible pour les EHPAD pour rompre l'isolement et maintenir le lien entre les patients, les résidents, leurs familles et leurs proches. J'ai pu développer différentes fontionnalités front et back pour ce projet."
    },
    {
        "id": 5,
        "name": "Site Fruggr.io",
        "img": "",
        "label": "Alternance développeur Fullstack",
        "company": "Digital4Better",
        "startingDate": "2022-04-04",
        "endingDate": "2022-07-04",
        "location": "Rennes",
        "technologies": ["React", "TypeScript", "Forestry"],
        "link": "https://www.fruggr.io/fr/",
        "description": "J'ai réalisé la refonte du site web avec une équipe composée d'un designer et d'une chargée de communication. Notre objectif principal était double. D'une part, nous voulions booster les performances du site pour fournir une expérience utilisateur encore meilleure, plus fluide et plus rapide. D'autre part, on a cherché à intégrer les meilleures pratiques SEO pour améliorer la visibilité du site sur les moteurs de recherche. C'était une collaboration enrichissante et pleine de défis où nous avons combiné nos compétences et notre expertise pour créer un site optimisé et esthétiquement attrayant. Nous avons mis un point d'honneur à garantir que le site non seulement fonctionne efficacement, mais aussi qu'il soit bien référencé pour attirer plus de trafic et améliorer sa visibilité en ligne. Au final, cette refonte nous a permis de présenter un site de qualité supérieure, optimisé pour les moteurs de recherche et centré sur l'utilisateur..."
    },
    {
        "id": 6,
        "name": "Dorval",
        "img": "",
        "label": "Alternance développeur Fullstack",
        "company": "Digital4Better",
        "startingDate": "2022-07-04",
        "endingDate": "2022-09-06",
        "location": "Rennes",
        "technologies": ["Javascript", "Strapi"],
        "link": "https://www.dorval-am.com/",
        "description": "Cette application avait pour but une refonte de leur site internet, j'ai donc participé à la migration de donnée de ce projet. Nous avons tout d'abord récupéré des fichiers venant d'une base de données utilisée par Drupal, il fallait ensuite parser les données, les traiter pour récupérer celles qui étaient importantes et les reformater pour les intégrer dans des composants Strapi crées en amont. Tout cela en js."
    },
    {
        "id": 7,
        "name": "DrumVr",
        "img": "",
        "label": "Projet école",
        "company": "Epitech",
        "startingDate": "2021-09-06",
        "endingDate": "2022-08-31",
        "location": "Rennes",
        "technologies": ["Unity", "C#"],
        "link": "",
        "description": "J'ai participé à la réalisation d'un projet Unity en réalité virtuelle, le but du projet était de faire une sorte de guitare hero pour la batterie. J'ai donc pu modéliser un environnement de studio pour le joueur ainsi qu'une interface de menu avec différentes fonctionnalités. Le jeu à ensuite été testé sur un oculus."
    },
    {
        "id": 8,
        "name": "Application Smartlife Coaching",
        "img": "",
        "label": "Alternance développeur Fullstack",
        "company": "Smartlife Coaching",
        "startingDate": "2022-09-05",
        "endingDate": "2023-07-28",
        "location": "Rennes",
        "technologies": ["Angular", "Ionic", "Nodejs", "MySql"],
        "link": "https://smartlife-coaching.com/",
        "description": "Avec deux autres développeurs, nous avons créés l'application Smartlife qui va améliorer le service proposé par l'entreprise. L'application comporte différentes propositions de ressources (podcasts, vidéos, articles), des programmes sportifs et nutritionnels a suivre par les clients, des calculs nutritionnels pour la création des recettes par les clients ainsi que des statistiques et un chat. Nous avons également mis un backoffice à la disposition des coachs pour la creations de tout le contenu disponibles ensuite pour les clients."
    },
    {
        "id": 9,
        "name": "Dashboard A-gO",
        "img": "",
        "label": "Développeur Fullstack Freelance",
        "company": "A-gO",
        "startingDate": "2023-07-01",
        "endingDate": "2023-09-28",
        "location": "Rennes",
        "technologies": ["Angular", "Ionic", "Nodejs", "MySql"],
        "link": "https://www.linkedin.com/company/a-go-motion/?originalSubdomain=fr",
        "description": "Dans le cadre d'un contrat freelance, j'ai développé une application web pour l'entreprise a-gO. L'application permet de visualiser différentes données, envoyées sous forme de format videos, ensuite analysées par une IA, et enfin affichées sous forme de graphiques. L'application permet également de créer, modifier, supprimer et visualiser des utilisateurs. Tout cela après une authentification. J'ai également mis en place l'infrastructure du projet sur aws"
    },
    {
        "id": 10,
        "name": "Suite PIANO Analytics",
        "img": "",
        "label": "Développeur Fullstack",
        "company": "AT internet PIANO",
        "startingDate": "2024-01-01",
        "endingDate": "2025-09-30",
        "location": "Boardeaux",
        "technologies": ["Angular", "NGRX", "Nestjs", "MongoDB", "GraphQl", "NGRX", "Jenkins"],
        "link": "https://www.piano.io/product/analytics",
        "description": "Au sein d’une équipe de développement agile, j’ai activement contribué au développement des applications frontend et backend de la suite PIANO Analytics, une plateforme d’analyse de données destinée à fournir des insights puissants pour la prise de décision stratégique. J’ai participé à la mise en œuvre de fonctionnalités clés, en veillant à la qualité du code grâce à l’écriture systématique de tests unitaires et à l’adoption de bonnes pratiques de développement. Dans un souci de performance et de fiabilité, j’ai également mis en place et maintenu des pipelines d’intégration continue (CI), permettant l’automatisation des tests et le déploiement fluide des mises à jour. Ce travail m’a permis d’acquérir une solide expérience en développement fullstack, tout en évoluant dans un environnement orienté produit, performance et data."
    },
    {
        "id": 11,
        "name": "Agent IA Web 3",
        "img": "",
        "label": "Développeur Fullstack",
        "company": "Projet personnel",
        "startingDate": "2025-03-01",
        "endingDate": "2025-06-30",
        "location": "Boardeaux",
        "technologies": ["Nextjs", "Nodejs", "OpenAI Playground", "Web3"],
        "link": "",
        "description": "J'ai créé un agent IA qui permet de réaliser des tâches sur le web 3. J'ai utilisé Nextjs pour le frontend, Nodejs pour le backend, OpenAI Playground pour l'IA et Web3 pour les transactions. J'ai également utilisé des librairies comme ethers.js pour les transactions et web3.js pour les interactions avec la blockchain. J'ai également utilisé des librairies comme ethers.js pour les transactions et web3.js pour les interactions avec la blockchain."
    }
]
